# Task32 Python
# Определить элементs массива (списка), значения которых принадлежат заданному диапазону 
# (т.е. не меньше заданного минимума и не больше заданного максимума)
# Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# 1
# 19
# Вывод: [1, 9, 13, 14, 19]


list1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
n = int(input("Введите min: "))
m = int(input("Введите max: "))
res = []
for i in range(len(list1)):
    if n <= list1[i] <= m: 
        res.append(list1[i])
        i += 1
print(res) 